Semester-7/Технология разработки прикладных решений 1С/lab10/src/Reports/ОстаткиТоваровТаблица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Report>
		<Properties>
			<Name>ОстаткиТоваровТаблица</Name>
		</Properties>
	</Report>
</MetaDataObject>

Semester-7/Технология разработки прикладных решений 1С/lab10/src/AccumulationRegisters/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Semester-7/Технология разработки прикладных решений 1С/lab10/src/Reports/ОстаткиТоваровТаблица/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)

	СформироватьНаСервере();

КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Остатки.Товар КАК Товар,
		|	Остатки.СрокГодности КАК СрокГодности,
		|	Остатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки КАК Остатки
		|УПОРЯДОЧИТЬ ПО
		|	Товар,
		|	СрокГодности";

	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Область(1, 1).Текст = "Товар";
	ТабДок.Область(1, 2).Текст = "Срок годности";
	ТабДок.Область(1, 3).Текст = "Количество";

	НомерСтроки = 1;
	Итого = 0;
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		НомерСтроки = НомерСтроки + 1;
		ТабДок.Область(НомерСтроки, 1).Текст = Строка(Выборка.Товар);
		// Задание 10, пункт 1: выводим только дату, без 00:00:00
		ТабДок.Область(НомерСтроки, 2).Текст = Формат(Выборка.СрокГодности, "ДЛФ=D");
		ТабДок.Область(НомерСтроки, 3).Текст = Формат(Выборка.Количество, "ЧДЦ=3; ЧН=0");
		Итого = Итого + Выборка.Количество;
	КонецЦикла;

	ТабДок.Область(НомерСтроки + 1, 1).Текст = "Итого";
	ТабДок.Область(НомерСтроки + 1, 3).Текст = Формат(Итого, "ЧДЦ=3; ЧН=0");

	РезультатОтчета = ТабДок;

КонецПроцедуры
